Tekla Open API Reference for Tekla Structures 2025
SymbolInfo.Default Field
 The default symbol information: the symbol 0 in the xsteel library.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static SymbolInfo Default
Public Shared Default As SymbolInfo
Field Value
Type: SymbolInfo
See Also
Reference
SymbolInfo Class
Tekla.Structures.Drawing Namespace